In [1]:
import pandas as pd
#creating a sample data
homelessness = pd.DataFrame({
    "state": ["California", "Texas", "New York", "Florida", "Colorado", "Oregon"],
    "region": ["Pacific", "West South Central", "Mid-Atlantic", "South Atlantic", "Mountain", "Pacific"],
    "individuals": [151278, 27000, 92000, 28000, 10500, 14500],
    "family_members": [34500, 8900, 18000, 12000, 950, 800]
})

homelessness

        state              region  individuals  family_members
0  California             Pacific       151278           34500
1       Texas  West South Central        27000            8900
2    New York        Mid-Atlantic        92000           18000
3     Florida      South Atlantic        28000           12000
4    Colorado            Mountain        10500             950
5      Oregon             Pacific        14500             800

In [3]:
#inspecting the dataframe
# First few rows
homelessness.head()

# Info about columns and missing values
homelessness.info()

# Shape (rows, columns)
homelessness.shape

# Summary statistics
homelessness.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   state           6 non-null      object
 1   region          6 non-null      object
 2   individuals     6 non-null      int64
 3   family_members  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

         individuals  family_members
count       6.000000        6.000000
mean    53879.666667    12525.000000
std     56150.551918    12631.300408
min     10500.000000      800.000000
25%     17625.000000     2937.500000
50%     27500.000000    10450.000000
75%     76000.000000    16500.000000
max    151278.000000    34500.000000

In [5]:
#Dataframe attributes
# Values as NumPy array
homelessness.values

# Column names
homelessness.columns

# Row index
homelessness.index

RangeIndex(start=0, stop=6, step=1)

In [7]:
#Sorting data ascending and descending
homelessness_ind = homelessness.sort_values("individuals")
homelessness_ind.head()
homelessness_fam = homelessness.sort_values("family_members", ascending=False)
homelessness_fam.head()

        state              region  individuals  family_members
0  California             Pacific       151278           34500
2    New York        Mid-Atlantic        92000           18000
3     Florida      South Atlantic        28000           12000
1       Texas  West South Central        27000            8900
4    Colorado            Mountain        10500             950

In [9]:
homelessness_reg_fam = homelessness.sort_values(
    ["region", "family_members"],
    ascending=[True, False]
)

homelessness_reg_fam

        state              region  individuals  family_members
2    New York        Mid-Atlantic        92000           18000
4    Colorado            Mountain        10500             950
0  California             Pacific       151278           34500
5      Oregon             Pacific        14500             800
3     Florida      South Atlantic        28000           12000
1       Texas  West South Central        27000            8900

In [11]:
#subsetting columns
individuals = homelessness["individuals"]
individuals

state_fam = homelessness[["state", "family_members"]]
state_fam

ind_state = homelessness[["individuals", "state"]]
ind_state

   individuals       state
0       151278  California
1        27000       Texas
2        92000    New York
3        28000     Florida
4        10500    Colorado
5        14500      Oregon

In [13]:
#subsetting or filtering rows
ind_gt_10k = homelessness[homelessness["individuals"] > 10000]
ind_gt_10k

mountain_reg = homelessness[homelessness["region"] == "Mountain"]
mountain_reg

fam_lt_1k_pac = homelessness[
    (homelessness["family_members"] < 1000) &
    (homelessness["region"] == "Pacific")
]

fam_lt_1k_pac

    state   region  individuals  family_members
5  Oregon  Pacific        14500             800